Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The first part of the expression is always resolved against the <<current_context_object,current context object>>. If no result is found for the first part, it's resolved against the parent context object (if available). For an expression that starts with a namespace the current context object is found using all the available ``NamespaceResolver``s. For an expression that does not start with a namespace the current context object is *derived from the position* of the tag. All other parts of an expression are resolved using all ``ValueResolver``s against the result of the previous resolution.
ja_jp: 式の最初のパーツは、常に <<current_context_object,current context object>> に対して解決されます。 最初のパーツの結果が見つからない場合、(利用可能な場合は) 親コンテキストオブジェクトに対して解決されます。 名前空間で始まる式の場合、現在のコンテキストオブジェクトは、利用可能なすべての ``NamespaceResolver`` を使用して検出されます。 名前空間で始まらない式の場合、現在のコンテキストオブジェクトはタグの *位置から導出* されます。 式の他のすべてのパーツは、前の解決結果に対してすべての ``ValueResolver`` を使用して解決されます。

source: The first part of the expression is always resolved against the xref:current_context_object[current context object]. If no result is found for the first part it's resolved against the parent context object (if available). For an expression that starts with a namespace the current context object is found using all the available ``NamespaceResolver``s. For an expression that does not start with a namespace the current context object is *derived from the position* of the tag. All other parts of an expression are resolved using all ``ValueResolver``s against the result of the previous resolution.
ja_jp: 式の最初のパーツは、常に xref:current_context_object[現在のコンテキスト・オブジェクト] に対して解決されます。最初のパーツに対して結果が見つからない場合は、親コンテキストオブジェクトに対して解決されます（利用可能な場合）。名前空間で始まる式の場合、現在のコンテキストオブジェクトは、利用可能なすべての `NamespaceResolver` を使用して見つけられます。名前空間で始まらない式の場合、現在のコンテキストオブジェクトは、タグの *位置から導き出されます* 。式の他のすべての部分は、前の解決の結果に対して、すべての `ValueResolver` s を使用して解決されます。

source: The first part, the application code checkout, compilation and packaging on the Ansible (where Ansible runs). We’ll use the getting-started sample application provided in its link:{quickstarts-tree-url}/getting-started[Quarkus QuickStarts directory] as a base for this tutorial. We’ll also leverage the https://galaxy.ansible.com/middleware_automation/quarkus[Quarkus collection] for Ansible, an extension for Ansible that alleviates the boilerplate required and to quickly build and deploy a Quarkus using Ansible.
ja_jp: 最初のパートは、Ansible（Ansibleが実行される場所）でのアプリケーションコードのチェックアウト、コンパイル、パッケージングです。このチュートリアルのベースとして、 link:{quickstarts-tree-url}/getting-started[Quarkus QuickStartsディレクトリ] で提供されているget-startedサンプルアプリケーションを使用します。また、Ansibleのエクステンションである link:https://galaxy.ansible.com/middleware_automation/quarkus[Quarkus collection] for Ansibleを活用して、これは、必要なボイラープレートを軽減し、Ansibleを使用してQuarkusを迅速にビルドおよびデプロイします。

source: The first reactive transaction is used to persist the entity.
ja_jp: 1 つ目のリアクティブトランザクションは、エンティティーを永続化するために使用されます。

source: The first sentence of the abstract must explain the value and some benefit of the content in less than 26 words because this automatically displays on the link:https://quarkus.io/guides/[Quarkus guides homepage].
ja_jp: 要約の最初の文は、26文字以内でコンテンツの価値と何らかの利益を説明する必要があります。これは、 link:https://quarkus.io/guides/[Quarkusガイド] のホームページに自動的に表示されるためです。

source: The first sentence of the abstract must explain the value and some benefit of the content in less than 27 words because this automatically displays on the link:https://quarkus.io/guides/[Quarkus guides homepage]. There must also be a line break before and after the abstract.
ja_jp: link:https://quarkus.io/guides/[Quarkusガイド] のホームページに自動的に表示されるため、要約の最初の文は、コンテンツの価値と何らかの利益を27単語以内で説明する必要があります。また、要約の前後で改行する必要があります。

source: The first sentence should be meaningful and self-contained as it is included in the summary table.
ja_jp: 最初のセンテンスは、サマリー表に含まれるため、意味があり、自己完結していることが望ましいです。

source: The first stage builds the native executable using Maven or Gradle
ja_jp: 最初の段階では、Maven または Gradle を使用してネイティブ実行可能ファイルをビルドします

source: The first step consists of implementing the `io.smallrye.stork.spi.ServiceDiscoveryProvider` interface:
ja_jp: 最初のステップは、 `io.smallrye.stork.spi.ServiceDiscoveryProvider` インターフェースの実装です。

source: The first step in a migration to Quarkus 3 is to run the migration script presented below.
ja_jp: Quarkus 3への移行の最初のステップは、以下に示す移行スクリプトを実行することです。

source: The first step is to configure and start the https://opentelemetry.io/docs/collector/[OpenTelemetry Collector] to receive, process and export telemetry data to https://www.jaegertracing.io/[Jaeger] that will display the captured traces.
ja_jp: 最初のステップは、テレメトリデータを受信して処理し、キャプチャしたトレースを表示する link:https://www.jaegertracing.io/[Jaeger]にエクスポートするための link:https://opentelemetry.io/docs/collector/[OpenTelemetry Collector]の設定と起動です。

source: The first step is to configure the `application.properties` file to point to your truststore and/or keystore. This is further detailed https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod_encryption[here].
ja_jp: 最初のステップは、 `application.properties` ファイルがトラストストアやキーストアを指すように設定することです。詳しくは link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod_encryption[こちら] をご覧ください。

source: The first step is to configure the `hotrod-client.properties` file to point to your truststore and/or keystore. This is further detailed https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod_encryption[here].
ja_jp: 最初のステップは、 `hotrod-client.properties` ファイルがトラストストアおよび/またはキーストアを指すように設定することです。これについては、 https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod_encryption[ここ] でさらに詳しく説明します。

source: The first step is to initialize a `JwtClaimsBuilder` by using one of the following options and add some claims to it:
ja_jp: 最初のステップとして、以下のオプションの 1 つを使用して `JwtClaimsBuilder` を初期化し、それにいくつかのクレームを追加します。

source: The first step is to initialize a `JwtClaimsBuilder` using one of the options below and add some claims to it:
ja_jp: 最初のステップとして、以下のオプションの 1 つを使用して `JwtClaimsBuilder` を初期化し、それにいくつかのクレームを追加します:

source: The first step is to set up the broker in our namespace. Following is an example command from the Knative cli.
ja_jp: 最初のステップは、私たちの名前空間にブローカーを設定することです。以下は、Knative cliのコマンド例です。

source: The first step is to set up the broker in our namespace. Following is an example command from the the Knative cli.
ja_jp: 最初のステップはネームスペースにブローカーを設定することです。 以下は Knative cli のコマンド例です。

source: The first step is to start the tracing system to collect and display the captured traces:
ja_jp: まず、キャプチャしたトレースを収集して表示するためのトレースシステムを起動します。

source: The first step to enable metrics is to add a few additional dependencies depending on the metrics framework you plan to use.
ja_jp: メトリクスの有効化の最初のステップは、使用する予定のメトリクスフレームワークに応じて、いくつかの依存関係を追加することです。

source: The first step was to group all of these extension-defined endpoints together. This was the genesis of the link:https://github.com/quarkusio/quarkus/pull/13601[non-application endpoint path]. The default location of this new path was `/q`, and it was nested under the HTTP root path, just as the other endpoints had been. The effect was to move `/health` to `/q/health`, as an example.
ja_jp: 最初のステップは、これらのエクステンションで定義されたエンドポイントをすべて一緒にグループ化することでした。これが、 link:https://github.com/quarkusio/quarkus/pull/13601[非アプリケーションエンドポイントパス]の始まりでした。この新しいパスのデフォルトの場所は `/q` で、他のエンドポイントと同様に HTTP ルートパスの下に入れ子になっていました。この効果は、例えば `/health` を `/q/health` に移動させることでした。

source: The first thing to note is that for pure Java lambda deployments require a specific handler class. Do not change the Lambda handler name.
ja_jp: 最初に注意することは、純粋なJavaラムダデプロイメントには特定のハンドラークラスが必要であるということです。 Lambdaハンドラー名は変更しないでください。

source: The first thing to note is that for the time being this set of extensions is currently considered experimental. Although the project passes almost the entirety of the JAX-RS TCK, it’s just the first release, so keep in mind that it might have more bugs than a typical battle hardened library, while some of the new APIs and SPIs might break. Despite this being a first release, we do envision this work becoming the default REST layer for Quarkus in the near future.
ja_jp: 最初に注意しなければならないのは、当面の間、この一連のエクステンションは実験的なものと考えられているということです。このプロジェクトはJAX-RS TCKのほぼ全体を通過していますが、まだ最初のリリースに過ぎませんので、典型的な実績のあるライブラリよりも多くのバグがあるかもしれないことを覚えておいてください。 これは最初のリリースですが、近い将来、このライブラリがQuarkusのデフォルトのRESTレイヤーになることを見通しています。

source: The first time you launch the `gcloud functions deploy`, you can have the following error message:
ja_jp: 初めて `gcloud beta functions deploy` を実行すると、以下のようなエラーメッセージが表示されます:

source: The first time you launch this command, you can have the following error message:
ja_jp: このコマンドを初めて起動したときには、以下のようなエラーメッセージが表示されることがあります:

source: The first two lines provide the Consul location used by the `Registration` bean.
ja_jp: 最初の2行は、 `Registration` Beanが使用するConsulのロケーションを提供します。

source: The first variant uses the Quarkus Maven build to create the _quarkus-app_ application structure containing the runnable "fast-jar" as well as all libraries needed inside Heroku's build infrastructure and then deploying that result, the other one uses a local build process to create an optimized container.
ja_jp: 1 つ目は、Quarkus の Maven ビルドを使用して、実行可能な "fast-jar "と Heroku のビルドインフラに必要なすべてのライブラリーを含む _quarkus-app_ アプリケーション構造を作成し、 その結果をデプロイするもので、もう 1 つはローカルビルドプロセスを使用して最適化されたコンテナーを作成するものです。

source: The first way to use reactive routes is to use the `@Route` annotation. To have access to this annotation, you need to add the `quarkus-reactive-routes` extension by running this command:
ja_jp: Reactive Routes を使用する最初の方法は、 `@Route` アノテーションを使用することです。このアノテーションにアクセスするには、次のコマンドを実行し `quarkus-reactive-routes` エクステンションを追加する必要があります。

source: The first way to use reactive routes is to use the `@Route` annotation. To have access to this annotation, you need to add the `quarkus-reactive-routes` extension:
ja_jp: Reactive Routes を使用する最初の方法は、 `@Route` アノテーションを使用することです。このアノテーションにアクセスするには、 `quarkus-reactive-routes` エクステンションを追加する必要があります。

source: The flame graph is a svg file that a web browser, such as Firefox, can easily display. After the above two commands complete one can open `flamegraph.svg` in their browser:
ja_jp: フレームグラフは、Firefox などの Web ブラウザーで簡単に表示できる svg ファイルです。上記の2つのコマンドが完了すると、ブラウザーで `flamegraph.svg` を開くことができます。

source: The flame graph is an svg file that a web browser, such as Firefox, can easily display. After the above two commands complete one can open `flamegraph.svg` in their browser:
ja_jp: フレームグラフは、FirefoxなどのWebブラウザで簡単に表示できるsvgファイルです。上記の2つのコマンドが完了すると、ブラウザで `flamegraph.svg` を開くことができます。

source: The flamegraph now shows where the bottleneck is. It's when `StringBuilder.delete()` is called which calls `System.arraycopy()`. The issue is that 1 million characters need to be shifted in very small increments:
ja_jp: フレームグラフを見ると、どこがボトルネックになっているかがわかります。それは、 `StringBuilder.delete()` が呼び出され、 `System.arraycopy()` を呼び出すときです。問題は、100万文字を非常に小さな単位でシフトさせる必要があることです。

source: The flamegraph produced looks odd. Each thread is treated independently even though they all do the same work. This makes it difficult to have a clear picture of the bottlenecks in the program.
ja_jp: 作成されたフレームグラフは奇妙に見えます。すべてのスレッドが同じ作業をしているにもかかわらず、各スレッドが独立して扱われています。これでは、プログラムのボトルネックを明確に把握することができません。

source: The flamegraph produced should look something like this:
ja_jp: 生成されたflamegraphは、次のようなものです:

source: The flamegraph should look similar to this:
ja_jp: flamegraphはこのような形になるはずです:

source: The flat classpath strategy is also used for GraalVM native images, since GraalVM does not really support multiple ClassLoaders.
ja_jp: GraalVMは複数のClassLoaderを実際にサポートしていないため、フラットクラスパス戦略はGraalVMネイティブイメージにも使用されます。

source: The following <<subject-example>> demonstrates an endpoint that uses both Jakarta REST and Common Security annotations to describe and secure its endpoints.
ja_jp: 次の <<subject-example>> は、エンドポイントを記述および保護するために Jakarta REST と Common Security アノテーションの両方を使用するエンドポイントを示します。

source: The following <<test-users-example>> illustrates the format:
ja_jp: 次の <<test-users-example>> はそのフォーマットを示しています：

source: The following HTTP request elements may be obtained by your endpoint method:
ja_jp: 次の HTTP リクエスト要素は、エンドポイントメソッドによって取得される可能性があります。

source: The following IDEs have support for the community developed Quarkus Tools:
ja_jp: 以下のIDEは、コミュニティで開発されたQuarkus Toolsをサポートしています。

source: The following Jakarta Persistence entity specification demonstrates how users' information needs to be stored in a Jakarta Persistence entity and correctly mapped so that Quarkus can retrieve this information from a database.
ja_jp: 次のJakarta Persistenceエンティティ定義は、Quarkusがデータベースからこの情報を取得できるよう、どのようにユーザの情報をJakarta Persistenceエンティティに格納し、正しくマッピングするかを示しています。

source: The following Jakarta Persistence entity specification demonstrates how users' information needs to be stored in a Jakarta Persistence entity and properly mapped so that Quarkus can retrieve this information from a database.
ja_jp: 次のJakarta Persistenceエンティティの定義は、Quarkusがデータベースからこの情報を取得できるように、ユーザーの情報をJakarta Persistenceエンティティに格納し、適切にマッピングする必要があることを示すものです。

source: The following URLs will be available once everything is ready:
ja_jp: 準備が整い次第、以下のURLで利用可能になります。

source: The following `application.properties` example shows how you can configure two tenants named `google` and `github`:
ja_jp: 次の `application.properties` の例は、`google` と `github` という名前の 2 つのテナントを設定する方法を示しています。

source: The following `application.properties` example shows how you can resolve the tenant identifier of two tenants named `a` and `b` by using the `TenantResolver` method:
ja_jp: 次の `application.properties` の例は、`TenantResolver` メソッドを使用して、`a` および `b` という名前の 2 つのテナントのテナント ID を解決する方法を示しています。

source: The following attributes are added by default to resources.
ja_jp: 次の属性はデフォルトでリソースに追加されます。

source: The following attributes are configured using:
ja_jp: 以下の属性は以下のように設定します:

source: The following categories of configuration properties have been deprecated.
ja_jp: 以下のカテゴリの設定プロパティーは非推奨となりました。

source: The following chapter describes the automatic and semi-automatic service binding approaches and their use cases. With either approach, the `kubernetes-service-binding` extension generates a `ServiceBinding` resource. With the semi-automatic approach, users must provide a configuration for target services manually. With the automatic approach, for a limited set of services generating the `ServiceBinding` resource, no additional configuration is needed.
ja_jp: 次の章では、自動および半自動のサービスバインディングのアプローチとそのユースケースについて説明します。どちらのアプローチでも、`kubernetes-service-binding` エクステンションは、`ServiceBinding` リソースを生成します。半自動アプローチでは、ユーザーはターゲットサービスの設定を手動で提供する必要があります。自動アプローチでは、`ServiceBinding` リソースを生成する限定されたサービスセットの場合、追加の設定は必要ありません。

source: The following code extracts a value identified by the `keyName` field from the `my-secret` Secret into a `foo` environment variable:
ja_jp: 以下のコードは、 `my-secret` シークレットから `keyName` フィールドで識別される値を `foo` 環境変数に抽出します：

source: The following code provides an example:
ja_jp: 以下のコードはその一例です。

source: The following code shows a simple example where we iterate over the parts and return a list of aggregated data:
ja_jp: 次のコードは、パートに対して反復処理を行い、集約されたデータのリストを返すという簡単な例です:

source: The following code snippet contains an example of a `KubernetesClientObjectMapperCustomizer` to set the `ObjectMapper` locale:
ja_jp: 次のコード・スニペットには、 `ObjectMapper` ロケールを設定する `KubernetesClientObjectMapperCustomizer` の例が含まれています：

source: The following command creates a simple KeyStore:
ja_jp: 次のコマンドは、単純なKeyStoreを作成します：

source: The following commands will set up Podman and environment variables up to work with Quarkus Dev Services and Testcontainers:
ja_jp: 以下のコマンドは、Quarkus Dev ServicesとTestcontainersで動作するようにPodmanと環境変数をセットアップします。

source: The following configuration example demonstrates how you can enforce a single selectable authentication mechanism for a given request path:
ja_jp: 次の設定例は、あるリクエストパスに対して、選択可能な単一の認証メカニズムを強制する方法を示しています:

source: The following configuration properties allow you to specify the default sets of propagated contexts:
ja_jp: 以下の設定プロパティでは、伝搬されるコンテキストのデフォルトセットを指定できます。

source: The following configuration properties are available when using the Undertow servlet extension.
ja_jp: Undertow Servlet エクステンションを使用する場合、以下の設定プロパティーを使用できます。

source: The following configuration settings alter the role-based access control (RBAC) denying behavior:
ja_jp: 以下の設定により、ロールベースアクセスコントロール（RBAC）の拒否動作が変更されます:

source: The following considerations apply:
ja_jp: 以下の考慮事項が適用されます。

source: The following contexts are available in Quarkus either out of the box, or depending on whether you include their extensions:
ja_jp: 以下のコンテキストは、Quarkusで設定不要で利用可能か、エクステンションを追加するかによって使用できます:

source: The following dependency might also be required to be added to your pom, if it's not yet added by other dependencies, otherwise Dev UI will not start during testing:
ja_jp: 他の依存関係によってまだ追加されていない場合、次の依存関係も pom に追加する必要がある場合があります。追加しないと、テスト中に Dev UI が起動しません。

source: The following diagram outlines the Authorization Code Flow mechanism in Quarkus.
ja_jp: 次の図は、Quarkus における認可コードフローメカニズムの概要を示しています。

source: The following diagram steps through the detailed process flow of the Quarkus Security architecture:
ja_jp: 次の図は、Quarkus Securityアーキテクチャの詳細なプロセスフローを段階的に説明したものです:

source: The following diagrams outline the Bearer Token Authorization mechanism in Quarkus:
ja_jp: 次の図は、Quarkus のBearer Token認可メカニズムの概要を示しています。

source: The following diagrams outline the Bearer token authentication mechanism in Quarkus:
ja_jp: 以下の図に、Quarkusのベアラートークン認証メカニズムの概要を示します：

source: The following endpoint supports serving cheese in plain text or JSON:
ja_jp: 次のエンドポイントは、プレーンテキストまたは JSON での cheese の提供をサポートしています。

source: The following example changes the `quarkus.datasource.db-kind` to `mysql`. For this to work the `mysql-extension` must have been included in the build. Augmentation can only use extensions that were present during compile time.
ja_jp: 次の例では、 `quarkus.datasource.db-kind` を `mysql` に変更しています。これを実行するには、 `mysql-extension` がビルドに含まれている必要があります。オーグメンテーションは、コンパイル時に存在していたエクステンションのみを使用することができます。

source: The following example configures a gRPC client named "hello" to use HTTPS with a truststore from the default TLS configuration:
ja_jp: 次の例では、"hello" という名前の gRPC クライアントを、デフォルトの TLS 設定のトラストストアと HTTPS を使用するように設定します。

source: The following example creates a topic named `test` with 3 partitions, and a second topic named `messages` with 2 partitions.
ja_jp: 次の例では、 `test` という名前のトピックを3つのパーティションで作成し、 `messages` という名前の2つ目のトピックを2つのパーティションで作成しています。

source: The following example creates a topic named `test` with three partitions, and a second topic named `messages` with two partitions.
ja_jp: 次の例では、3つのパーティションを持つ `test` という名前のトピックと、2つのパーティションを持つ `messages` という名前の2番目のトピックを作成します。

source: The following example customizes the line format used for StatsD:
ja_jp: 以下の例では、StatsDで使用される行フォーマットをカスタマイズしています。

source: The following example defines `HelloResource` and `HelloService`. Any GET request to `/hello` runs on the I/O thread and throws a `BlockingOperationNotAllowedException` exception.
ja_jp: 次の例では、`HelloResource` と `HelloService` を定義します。 `/hello` へのすべての GET リクエストは I/O スレッドで実行され、`BlockingOperationNotAllowedException` 例外が出力されます。

source: The following example defines two named proxies:
ja_jp: 次の例では、2 つの名前付きプロキシーを定義しています。

source: The following example demonstrates how to receive a payload, store it in the database using Hibernate Reactive with Panache, and send the persisted entity to Kafka:
ja_jp: 次の例は、ペイロードを受信し、Hibernate Reactive with Panache を使用してデータベースに保存し、永続化されたエンティティーを Kafka に送信する方法を示しています。

source: The following example demonstrates storing security information by adding annotations to the `user` entity:
ja_jp: 次の例では、 `user` エンティティにアノテーションを追加して、セキュリティ情報の保存をデモします:

source: The following example demonstrates:
ja_jp: 以下の例は、次のことを示しています。

source: The following example enables transaction support:
ja_jp: 次の例では、トランザクションサポートを有効にします。

source: The following example illustrates all those possibilities:
ja_jp: 次の例は、これらすべての可能性を示しています。

source: The following example illustrates the use with PostgreSQL, but the approach is applicable to all containers.
ja_jp: 次の例は PostgreSQL での使用法を示していますが、このアプローチはすべてのコンテナーに適用できます。

source: The following example includes a batch of Kafka records inside a transaction.
ja_jp: 次の例には、トランザクション内の Kafka レコードのバッチが含まれています。

source: The following example includes a batch of Pulsar messages inside a transaction.
ja_jp: 次の例には、トランザクション内の Pulsar メッセージのバッチが含まれています。

source: The following example provides three different datasources:
ja_jp: 以下の例では、3つの異なるデータソースを提供しています:

source: The following example shows a complete CORS filter configuration, including a regular expression to define one of the origins.
ja_jp: 次の例は、オリジンの 1 つを定義する正規表現など、完全な CORS フィルター設定を示しています。

source: The following example shows a reactive liveness check:
ja_jp: 以下の例では、リアクティブなLivenessチェックを行っています:

source: The following example shows how the `LibraryPermission` class can be used:
ja_jp: 次の例は、 `LibraryPermission` クラスの使用方法を示しています。

source: The following example shows how to configure a secured Route by using passthrough termination by adding the "quarkus.openshift.route.tls" properties:
ja_jp: 次の例では、"quarkus.openshift.route.tls" プロパティを追加して、パススルー終端を使用して保護されたRouteを設定する方法を示します：

source: The following example shows how to customize the `apiVersion` property of the `PostgresCluster` resource:
ja_jp: 次の例は、`PostgresCluster` リソースの `apiVersion` プロパティーをカスタマイズする方法を示しています。

source: The following example shows how to implement a custom codec for a `Item` class:
ja_jp: 次の例は、 `Item` クラスのカスタムコーデックを実装する方法を示しています。

source: The following example shows how you can configure `quarkus-oidc` to support `mTLS`:
ja_jp: 次の例は、 `mTLS` をサポートするように `quarkus-oidc` を設定する方法を示しています。

source: The following example shows that for a named datasource, the datasource name is used as the name of the target resource:
ja_jp: 次の例は、名前付きデータソースの場合、データソース名がターゲットリソースの名前として使用されることを示しています。

source: The following example shows the secret retrieved from a xref:credentials-provider.adoc[credentials provider]:
ja_jp: 次の例は、xref:credentials-provider.adoc[クレデンシャルプロバイダー] から取得したシークレットを示しています。

source: The following example shows the various possible usages:
ja_jp: 次の例では、さまざまな使い方を紹介します:

source: The following example will **not** work in native mode because the generic type of watcher cannot be determined by looking at the class and method definitions thus making Quarkus unable to properly determine the Kubernetes model class for which reflection registration is needed:
ja_jp: 以下の例では、クラスやメソッドの定義を見てウォッチャーのジェネリック型を判断できないため、Quarkusはリフレクション登録が必要なKubernetesモデルクラスを適切に判断できないため、ネイティブモードでは動作 *しません* 。

source: The following examples are for the active record pattern, but the same can be used with repositories.
ja_jp: 以下の例はアクティブレコードパターンの場合ですが、リポジトリでも同じように使用できます。

source: The following examples show how to configure logging in {project-name}:
ja_jp: 以下の例は、{project-name} でロギングを設定する方法を示しています。

source: The following examples show some of the ways in which you can configure logging in Quarkus:
ja_jp: 以下の例は、Quarkusでロギングを設定する方法をいくつか示しています:

source: The following examples show some of the ways in which you can configure logging in {project-name}:
ja_jp: 以下の例は、{project-name} でロギングを設定する方法をいくつか示しています:

source: The following examples uses _hello_ as the client name. Don't forget to replace it with the name you used in in the `@GrpcClient` annotation.
ja_jp: 以下の例では、クライアント名として _hello_ を使用しています。 `@GrpcClient` アノテーションで使用した名前に置き換えることを忘れないでください。

source: The following examples uses _hello_ as the client name. Don't forget to replace it with the name you used in the `@GrpcClient` annotation.
ja_jp: 以下の例では、クライアント名として _hello_を使用しています。 `@GrpcClient` アノテーションで使用した名前に置き換えることを忘れないでください。

source: The following examples will all be based on the same example application that you can create with the following steps.
ja_jp: 以下の例はすべて、以下の手順で作成できる同じアプリケーションの例を基にしています。
